/*********************************************************
 * 与数字相关的题目
 * 简单的解法不在使用Solution类，直接使用一个函数实现即可
 * 所有的函数依旧包含在命名空间leetCode中
 * *******************************************************/

namespace leetCode
{
    /************************************************************************
     * 给定一个 32 位的有符号整数 x ，返回将 x 中的数字部分反转后的结果。
     * 如果反转后整数超过 32 位的有符号整数的范围 [−2^31,  2^31 − 1] ，就返回 0
     ********************************************************************/
    int reverse(int num);
} // namespace leetCode


